---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.WallJoinFailures
source: html/63550bb2-a14c-4bbe-8a4a-186b4fbb6cbb.htm
---
# BuiltInFailures.WallJoinFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.